// #0pm3EyTKy9
//
// – Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
//
//     #mDMWMW5a
//
// – Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//
// #4sXhaa5YMM
//
// – Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//
// #s24slNyz7
//
// – Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
//
// #zananT5FR1
//
// – Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
//
// #Tfrwls7FM
//
// – Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write


// – Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.


let arr = [];

arr[0] = 10;
arr[1] = 'hello';
arr[2] = true;
arr[3] = 3.14;
arr[4] = false;
arr[5] = 'javascript';
arr[6] = 100;
arr[7] = null;
arr[8] = 'code';
arr[9] = true;

for (let i = 0; i < arr.length; i++) {
    console.log(arr[i]);
}


//-------------------------------------------

// – Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 10; i++) {
//  console.log(i);
//  document.write( i + '<br>')
// }


//---------------------------------------------------

// – Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 100; i++) {
//     console.log(i);
//     document.write( i + '<br>')
// }

//---------------------------------------------------

// – Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 100; i += 2) {
//     console.log(i);
//     document.write( i + '<br>')
// }

//---------------------------------------------------

// – Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

// for (let i = 0; i < 100; i++) {
//
//     if (i % 2 === 0) {
//
//         console.log(i);
//
//         document.write(i + '<br>');
//     }
//
// }

//---------------------------------------------------

// – Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
for (let i = 0; i < 100; i++) {

    if (i % 2 !== 0) {

        console.log(i);

        document.write(i + '<br>');
    }

}