// #yHAwJOyiC
//
// – Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
//
//     #GamKju89ob
//
// – Створити масив з 10 строкових елементів. Вивести в консоль всі його елементи в циклі.
//
//     #Bm76xmg
//
// – Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
//
//     #u3vmD0YJXh
//
// – Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
//
// #9stMq2ou
//
// – Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
//
// #mK4pmM4
//
// – Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи



// #yHAwJOyiC
//
// – Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

let numbers = [10, 25, 7, 100, -5, 42, 8, 13, 99, 1];

// for (const number of numbers) {
//     console.log(number);
// }
//--------------------------------------------

//     #GamKju89ob
//
// – Створити масив з 10 строкових елементів. Вивести в консоль всі його елементи в циклі.

let strings = ['hello', 'world', 'javascript', 'html', 'css', 'react', 'node', 'java', 'python', 'code'];

// for (let i = 0 ; i < strings.length; i++) {
//     console.log(strings[i]);
// }

//--------------------------------------------

//     #Bm76xmg
//
// – Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

let arr = [10, 'hello', true, 3.14, false, 'javascript', 100, 'code', null, 'world'];

// let i = 0;
//
// while (i < arr.length) {
//     console.log(arr[i]);
//     i++;
// }

//--------------------------------------------

//     #u3vmD0YJXh
//
// – Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

// for (let i =0 ; i < arr.length ; i++){
//     if ( typeof arr[i] === "boolean" ){
//         console.log(arr[i]);
//     }
//
// }

//--------------------------------------------

// #9stMq2ou
//
// – Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи

// for (let i =0 ; i < arr.length ; i++){
//     if ( typeof arr[i] === "number" ){
//         console.log(arr[i]);
//     }
//
// }

//--------------------------------------------

// #mK4pmM4
//
// – Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

for (let i =0 ; i < arr.length ; i++){
    if ( typeof arr[i] === "string" ){
        console.log(arr[i]);
    }

}