// #qLQLJSeN7i
//
// – є масив [2,17,13,6,22,31,45,66,100,-18] :
//
// 1. перебрати його циклом while
//
//     2. перебрати його циклом for
//
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
//
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//
// 6. перебрати циклом for та вивести  числа тільки парні  значення
//
// 7. замінити кожне число, кратне 3, на слово “okten”
//
// 8. вивести масив у зворотньому порядку.
//
// 9. всі попередні завдання (окрім 8), але у зворотньому циклі (задом наперед)

let numbers = [2,17,13,6,22,31,45,66,100,-18];

// 1. перебрати його циклом while
// let i = 0;
// while (i < numbers.length) {
//     console.log(numbers[i]);
//     i++;
// }
// -------------------------------------------------------

//     2. перебрати його циклом for
// for (let i = 0; i < numbers.length; i++) {
//     console.log(numbers[i])
// }
// -------------------------------------------------------

//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let j =0;
// while (j < numbers.length) {
//     if (j % 2 !==0) {
//         console.log(numbers[j]);
//     }
//     j++;
// }
// -------------------------------------------------------

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//
// for (let i = 0; i < numbers.length; i++) {
//     if (i % 2 !== 0) {
//         console.log(numbers[i]);
//     }
// }
//
// -------------------------------------------------------

// 5. перебрати циклом while та вивести  числа тільки парні  значення
//
// let d =0;
// while (d < numbers.length) {
//     if (numbers[d] % 2 ===0) {
//         console.log(numbers[d]);
//     }
//     d++;
// }
//
// -------------------------------------------------------

// 6. перебрати циклом for та вивести  числа тільки парні  значення

// for (let i = 0; i < numbers.length; i++) {
//     if (numbers[i] % 2 === 0) {
//         console.log(numbers[i]);
//     }
// }
//
// -------------------------------------------------------

// 7. замінити кожне число, кратне 3, на слово “okten”

// for (let i = 0; i < numbers.length; i++) {
//     if (numbers[i] % 3 === 0) {
//         numbers[i] = 'okten';
//     }
// }
// console.log(numbers);
//
// -------------------------------------------------------
//
// 8. вивести масив у зворотньому порядку.

// for (let i = numbers.length - 1; i >= 0; i--) {
//     console.log(numbers[i]);
// }

// -------------------------------------------------------
//
// let i = numbers.length - 1;
//
// while (i >= 0) {
//     console.log(numbers[i]);
//     i--;
// }

// -------------------------------------------------------

// for (let i = numbers.length - 1; i >= 0; i--) {
//     console.log(numbers[i]);
// }

// -------------------------------------------------------
// while (непарні індекси назад)
// let i = numbers.length - 1;
//
// while (i >= 0) {
//     if (i % 2 !== 0) {
//         console.log(numbers[i]);
//     }
//     i--;
// }

// -------------------------------------------------------
// for (непарні індекси назад)
// for (let i = numbers.length - 1; i >= 0; i--) {
//     if (i % 2 !== 0) {
//         console.log(numbers[i]);
//     }
// }

// -------------------------------------------------------
//while (парні значення назад)
// let i = numbers.length - 1;
//
// while (i >= 0) {
//     if (numbers[i] % 2 === 0) {
//         console.log(numbers[i]);
//     }
//     i--;
// }
// -------------------------------------------------------
//for (парні значення назад)
// for (let i = numbers.length - 1; i >= 0; i--) {
//     if (numbers[i] % 2 === 0) {
//         console.log(numbers[i]);
//     }
// }
// -------------------------------------------------------

//кратні 3 - "okten" (назад)

let reversed = [];

for (let i = numbers.length - 1; i >= 0; i--) {
    if (numbers[i] % 3 === 0) {
        reversed.push('okten');
    } else {
        reversed.push(numbers[i]);
    }
}

console.log(reversed);

// -------------------------------------------------------