// 1. Створити пустий масив та :
//
//     a. заповнити його 50 парними числами за допомоги циклу.
//
//     b. заповнити його 50 непарними числами за допомоги циклу.
//
//     c. Заповнити масив 20-ма рандомними числами. (Google: Generate random number JS)
//
// d. Заповнити масив 20-ма рандомними числами в діапазоні від 8 до 732 (Google: Generate random number JS)
//
// 2. Вивести за допомогою console.log кожен третій елемент
//
// 3. Вивести за допомогою console.log кожен третій елемент, тільки якщо цей елемент є парним.
//
// 4. Вивести за допомогою console.log кожен третій елемент, тільки якщо цей елемент є парним, та записати їх в новий масив
//
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
//
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
//
// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
//
//
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//
// 8. Створити масив з будь-якими значеннями (стрінги, числа, і тд…). пройтись по ньому, і, якщо елемент є числом, додати його в інший масив.

let arr = [];


// a) 50 парних чисел
for (let i = 0; i < 100; i += 2) {
    arr.push(i);
}


// b) 50 непарних чисел
for (let i = 1; i < 100; i += 2) {
    arr.push(i);
}


// c) 20 random чисел
for (let i = 0; i < 20; i++) {

    let random = Math.floor(Math.random() * 100);

    arr.push(random);
}


// d) random від 8 до 732
for (let i = 0; i < 20; i++) {

    let random = Math.floor(Math.random() * (732 - 8 + 1)) + 8;

    arr.push(random);
}


console.log(arr);


// 2. Вивести за допомогою console.log кожен третій елемент

// for (let i = 2; i < arr.length; i += 3) {
//     console.log(arr[i]);
// }

// 3. Вивести за допомогою console.log кожен третій елемент, тільки якщо цей елемент є парним.



for (let i = 2; i < arr.length; i += 3) {
    if (arr[i] % 2 === 0  ) {
        console.log(arr[i]);
    }

}

// 4. Вивести за допомогою console.log кожен третій елемент, тільки якщо цей елемент є парним, та записати їх в новий масив
let newArr = [];

for (let i = 2; i < arr.length; i += 3) {
    if (arr[i] % 2 === 0  ) {
        console.log(arr[i]);
        newArr.push(arr[i]);
    }

}

console.log(newArr);


// 5. Вивести кожен елемент масиву, сусід справа якого є парним

// for (let i = 0; i < arr.length; i++) {
//
//     if (arr[i + 1] % 2 === 0) {
//         console.log(arr[i]);
//     }
//
// }

// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.

let prices = [100, 250, 50, 168, 120, 345, 188];

let sum = 0;

for (let i = 0; i < prices.length; i++) {

    sum += prices[i];

}
let average = sum / prices.length;
console.log(prices);
console.log(average);

// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.

let arr2 = [];
let newArr2 = [];

for (let i = 0; i < 10; i++) {

    let random = Math.floor(Math.random() * 100);

    arr2.push(random);
}

for (let i = 0; i < arr2.length; i++) {

    newArr2.push(arr2[i] * 5);

}


console.log(arr2);
console.log(newArr2);

// 8. Створити масив з будь-якими значеннями (стрінги, числа, і тд…). пройтись по ньому, і, якщо елемент є числом, додати його в інший масив.

let arr3 = [
    10,
    'hello',
    true,
    25,
    'javascript',
    false,
    100,
    'code',
    3.14,
    null
];

let numbers = [];


for (let i = 0; i < arr3.length; i++) {

    if (typeof arr3[i] === 'number') {

        numbers.push(arr3[i]);

    }

}


console.log(numbers);